# Victorian Hotels

In [1]:
# Importing the relevant module for Dataset cleaning
import pandas as pd

In [2]:
victoria_hotels_df = pd.read_csv('Raw_Data/victorian_country_hotels.csv')
victoria_hotels_df

,Title,Name,Relationship,Date,Source
0,"LambInn&Store,YanYean",Abbott,Licensee,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
1,"MorrellsJunction,Mooroopna",Allen,Licensee,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
2,"Rose&Crown,Ballarat","Arthur,J",Notidentified,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
3,"CommercialHotel&PostOffice&Store,Indigo","Ashdown,James",Licensee,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
4,"Royal,Rupanyup","Ashmore,GeorgeCharles",Licensee,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
...,...,...,...,...,...
381,"BrewersArms,Ballarat","Wright,T",Notidentified,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
382,"AsylumHill,Ararat",NaN,Notidentified,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
383,"Victoria,RedHill",NaN,Notidentified,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
384,"Camp,Beaufort",NaN,Notidentified,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...
385,"BontheramboHotel&PO,Boorhaman",NaN,Notidentified,Notidentified,ahotelentryintheRobertK.ColeIndexofVictorianho...

In [3]:
# Keeping relevant columns
victoria_hotels_1 = victoria_hotels_df.drop(columns=['Name','Relationship','Date','Source'])
victoria_hotels_1

                                       Title
0                      LambInn&Store,YanYean
1                 MorrellsJunction,Mooroopna
2                        Rose&Crown,Ballarat
3    CommercialHotel&PostOffice&Store,Indigo
4                             Royal,Rupanyup
..                                       ...
381                     BrewersArms,Ballarat
382                        AsylumHill,Ararat
383                         Victoria,RedHill
384                            Camp,Beaufort
385            BontheramboHotel&PO,Boorhaman

[386 rows x 1 columns]

In [4]:
# Need to seperate hotel name from city
location = victoria_hotels_1['Title'].str.split(",", n=1, expand=True)
location

                                    0          1
0                       LambInn&Store    YanYean
1                    MorrellsJunction  Mooroopna
2                          Rose&Crown   Ballarat
3    CommercialHotel&PostOffice&Store     Indigo
4                               Royal   Rupanyup
..                                ...        ...
381                       BrewersArms   Ballarat
382                        AsylumHill     Ararat
383                          Victoria    RedHill
384                              Camp   Beaufort
385               BontheramboHotel&PO  Boorhaman

[386 rows x 2 columns]

In [5]:
# Updating the Dataframe
victoria_hotels_1['City'] = location[1]

In [6]:
# Dropping the Title column
victoria_hotels_2 = victoria_hotels_1.drop(columns=['Title']).copy()
victoria_hotels_2

          City
0      YanYean
1    Mooroopna
2     Ballarat
3       Indigo
4     Rupanyup
..         ...
381   Ballarat
382     Ararat
383    RedHill
384   Beaufort
385  Boorhaman

[386 rows x 1 columns]

In [7]:
# Adding the Hotel Names again
victoria_hotels_2['Hotel'] = location[0]
victoria_hotels_2

          City                             Hotel
0      YanYean                     LambInn&Store
1    Mooroopna                  MorrellsJunction
2     Ballarat                        Rose&Crown
3       Indigo  CommercialHotel&PostOffice&Store
4     Rupanyup                             Royal
..         ...                               ...
381   Ballarat                       BrewersArms
382     Ararat                        AsylumHill
383    RedHill                          Victoria
384   Beaufort                              Camp
385  Boorhaman               BontheramboHotel&PO

[386 rows x 2 columns]

In [8]:
# Removing spaces in the columns
victoria_hotels_2['Hotel'] = victoria_hotels_2['Hotel'].str.strip()
victoria_hotels_2['City'] = victoria_hotels_2['City'].str.strip()
victoria_hotels_2

          City                             Hotel
0      YanYean                     LambInn&Store
1    Mooroopna                  MorrellsJunction
2     Ballarat                        Rose&Crown
3       Indigo  CommercialHotel&PostOffice&Store
4     Rupanyup                             Royal
..         ...                               ...
381   Ballarat                       BrewersArms
382     Ararat                        AsylumHill
383    RedHill                          Victoria
384   Beaufort                              Camp
385  Boorhaman               BontheramboHotel&PO

[386 rows x 2 columns]

In [9]:
# Exporting dataframe
victoria_hotels_2.to_csv('cleaned_data/vic_hotels_clean.csv')

# Victorian Population

In [10]:
# Reading the CSV File
victorial_population = pd.read_csv('Raw_Data/victoria_population.csv')
victorial_population

,LGAcode,Shire,2018,2019,2018-2019,percentagechange,Naturalincrease,Netinternalmigration,Netoverseasmigration,Areakm^2,Populationdensity
0,20110,AlpineS,12730,12814,84,0.7,-49,61,72,4788.2,2.7
1,20260,AraratRC,11795,11845,50,0.4,-5,-8,63,4211.1,2.8
2,20570,BallaratC,107324,109505,2181,2.0,444,1187,550,739.0,148.2
3,20660,BanyuleC,130250,131631,1381,1.1,573,-492,1300,62.5,2104.7
4,20740,BassCoastS,35326,36320,994,2.8,-27,901,120,865.8,41.9
...,...,...,...,...,...,...,...,...,...,...,...
73,27170,WodongaC,41429,42083,654,1.6,266,193,195,432.7,97.3
74,27260,WyndhamC,255367,270487,15120,5.9,4039,6392,4689,542.1,499.0
75,27350,YarraC,98567,101495,2928,3.0,693,334,1901,19.5,5193.6
76,27450,YarraRangesS,158171,159462,1291,0.8,1137,-480,634,2468.2,64.6
77,27630,YarriambiackS,6658,6639,-19,-0.3,-51,18,14,7325.8,0.9

In [11]:
# Renaming Shire to Council
victorial_population_1 = victorial_population.rename(columns={'Shire':'Council'})
victorial_population_1

,LGAcode,Council,2018,2019,2018-2019,percentagechange,Naturalincrease,Netinternalmigration,Netoverseasmigration,Areakm^2,Populationdensity
0,20110,AlpineS,12730,12814,84,0.7,-49,61,72,4788.2,2.7
1,20260,AraratRC,11795,11845,50,0.4,-5,-8,63,4211.1,2.8
2,20570,BallaratC,107324,109505,2181,2.0,444,1187,550,739.0,148.2
3,20660,BanyuleC,130250,131631,1381,1.1,573,-492,1300,62.5,2104.7
4,20740,BassCoastS,35326,36320,994,2.8,-27,901,120,865.8,41.9
...,...,...,...,...,...,...,...,...,...,...,...
73,27170,WodongaC,41429,42083,654,1.6,266,193,195,432.7,97.3
74,27260,WyndhamC,255367,270487,15120,5.9,4039,6392,4689,542.1,499.0
75,27350,YarraC,98567,101495,2928,3.0,693,334,1901,19.5,5193.6
76,27450,YarraRangesS,158171,159462,1291,0.8,1137,-480,634,2468.2,64.6
77,27630,YarriambiackS,6658,6639,-19,-0.3,-51,18,14,7325.8,0.9

In [12]:
# Exporting dataframe 
victorial_population_1.to_csv('cleaned_data/vic_population_clean.csv')

# Victorian Councils

In [13]:
victorian_councils = pd.read_csv('Raw_Data/city_shire.csv')
victorian_councils

                  City             Council
0       Abbeyard(3737)             AlpineS
1     Abbotsford(3067)              YarraC
2     Aberfeldie(3040)       MooneeValleyC
3      Aberfeldy(3825)             BawBawS
4        Acheron(3714)        MurrindindiS
...                ...                 ...
3552               NaN                 NaN
3553               NaN                 NaN
3554               NaN                 NaN
3555     Zeerust(3634)  GreaterSheppartonC
3556   Zumsteins(3401)  NorthernGrampiansS

[3557 rows x 2 columns]

In [14]:
cities = victorian_councils['City'].str.split("(", n=1, expand=True)
cities

               0      1
0       Abbeyard  3737)
1     Abbotsford  3067)
2     Aberfeldie  3040)
3      Aberfeldy  3825)
4        Acheron  3714)
...          ...    ...
3552         NaN    NaN
3553         NaN    NaN
3554         NaN    NaN
3555     Zeerust  3634)
3556   Zumsteins  3401)

[3557 rows x 2 columns]

In [15]:
# Dropping the Column
victorian_councils_1 = victorian_councils.drop(columns=['City']).copy()
victorian_councils_1

                 Council
0                AlpineS
1                 YarraC
2          MooneeValleyC
3                BawBawS
4           MurrindindiS
...                  ...
3552                 NaN
3553                 NaN
3554                 NaN
3555  GreaterSheppartonC
3556  NorthernGrampiansS

[3557 rows x 1 columns]

In [16]:
# Adding the Cities Column
victorian_councils_1['City'] = cities[0]
victorian_councils_1

                 Council        City
0                AlpineS    Abbeyard
1                 YarraC  Abbotsford
2          MooneeValleyC  Aberfeldie
3                BawBawS   Aberfeldy
4           MurrindindiS     Acheron
...                  ...         ...
3552                 NaN         NaN
3553                 NaN         NaN
3554                 NaN         NaN
3555  GreaterSheppartonC     Zeerust
3556  NorthernGrampiansS   Zumsteins

[3557 rows x 2 columns]

In [17]:
# Removing Nan values
victorian_councils_2 = victorian_councils_1.dropna()
victorian_councils_2

                 Council        City
0                AlpineS    Abbeyard
1                 YarraC  Abbotsford
2          MooneeValleyC  Aberfeldie
3                BawBawS   Aberfeldy
4           MurrindindiS     Acheron
...                  ...         ...
3549               HumeC      Yuroke
3550         ColacOtwayS     Yuulong
3551        CorangamiteS     Yuulong
3555  GreaterSheppartonC     Zeerust
3556  NorthernGrampiansS   Zumsteins

[3513 rows x 2 columns]

In [16]:
test1 = pd.merge(victoria_hotels_2,victorian_councils_2, on='City', how='outer')

In [17]:
test2 = test1.dropna()
test2

             City                Hotel             Council
0         YanYean        LambInn&Store          NillumbikS
1         YanYean        LambInn&Store         WhittleseaC
2       Mooroopna     MorrellsJunction  GreaterSheppartonC
3       Mooroopna           Commercial  GreaterSheppartonC
4       Mooroopna           Commercial  GreaterSheppartonC
..            ...                  ...                 ...
416  Glenthompson                 Macs            AraratRC
417  Glenthompson                 Macs      SthnGrampiansS
418        Ararat           AsylumHill            AraratRC
419      Beaufort                 Camp           PyreneesS
420     Boorhaman  BontheramboHotel&PO        WangarattaRC

[404 rows x 3 columns]

In [18]:
test4 = pd.merge(test2,victorial_population_1,on='Council', how='inner')

In [19]:
test4

,City,Hotel,Council,LGAcode,2018,2019,2018-2019,percentagechange,Naturalincrease,Netinternalmigration,Netoverseasmigration,Areakm^2,Populationdensity
0,YanYean,LambInn&Store,NillumbikS,25710,64941,65094,153,0.2,294,-450,309,432.3,150.6
1,YanYean,LambInn&Store,WhittleseaC,27070,223347,230238,6891,3.1,2270,1556,3065,489.7,470.2
2,Thomastown,Belmont,WhittleseaC,27070,223347,230238,6891,3.1,2270,1556,3065,489.7,470.2
3,Mooroopna,MorrellsJunction,GreaterSheppartonC,22830,66008,66498,490,0.7,312,-355,533,2421.9,27.5
4,Mooroopna,Commercial,GreaterSheppartonC,22830,66008,66498,490,0.7,312,-355,533,2421.9,27.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
369,Kerang,Royal,GannawarraS,22250,10546,10472,-74,-0.7,-36,-42,4,3735.3,2.8
370,Kerang,Royal,GannawarraS,22250,10546,10472,-74,-0.7,-36,-42,4,3735.3,2.8
371,Dandenong,Shamrock,GreaterDandenongC,22670,166140,168201,2061,1.2,1308,-3162,3915,129.5,1298.4
372,NarNarGoon,NarNarGoon,CardiniaS,21450,107117,112159,5042,4.7,1294,3204,544,1282.6,87.4
373,Frankston,BayView,FrankstonC,22170,141847,142643,796,0.6,746,-733,783,129.6,1100.7